{
  "data": [
    {
      "title": "Cooking Class",
      "description": "Experience a culinary adventure with your partner on a cooking class date. Learn the art of preparing delicious dishes under the guidance of skilled chefs. Explore new flavors, techniques, and create culinary masterpieces together. Indulge in a fun and interactive date where you bond over food, laughter, and shared culinary creativity.",
      "image": "./images/CookingClass.jpg",
      "id": 1,
      "indoor": true,
      "outdoor": false,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Art Gallery ",
      "description": "Immerse yourselves in the world of creativity on a captivating art gallery date. Discover captivating masterpieces, engage in thought-provoking conversations, and appreciate the beauty of local art. Let the vibrant artwork inspire and deepen your connection as you explore the rich artistic expressions together. ",
      "image": "./images/ArtGallery.jpg",
      "id": 2,
      "indoor": true,
      "outdoor": false,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Pottery Workshop",
      "description": "Unleash your creativity and get your hands dirty on a pottery workshop date. Mold clay into beautiful creations together, while enjoying a hands-on experience that sparks laughter and connection. Explore the art of ceramics as you shape memories and create lasting masterpieces side by side.",
      "image": "./images/PotteryClass.jpg",
      "id": 3,
      "indoor": true,
      "outdoor": false,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Board Game Cafe",
      "description": "Bring out the competitive spirit on a board game date or double date. Gather around the table, strategize, and have a blast with classic or modern board games. Enjoy friendly banter, laughter, and a fun-filled evening of bonding over dice rolls and card flips. ",
      "image": "./images/BoardGame.jpg",
      "id": 4,
      "indoor": true,
      "outdoor": false,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Botanical Garden",
      "description": "Escape into a lush oasis with a date to a botanical garden. Stroll hand in hand amidst vibrant flora, immerse yourselves in the serene atmosphere and discover the beauty of nature together. A perfect setting for intimate conversations and creating lasting memories.",
      "image": "./images/BotanicalGarden.jpg",
      "id": 5,
      "indoor": true,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Picnic Area",
      "description": "Indulge in a cozy picnic date, where you can savor delicious treats and create a romantic atmosphere away from the elements. With soft blankets, ambient lighting, and delightful bites, it's a perfect setting for an intimate and memorable experience together.",
      "image": "./images/Picnic.jpg",
      "id": 6,
      "indoor": false,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "VR Experience",
      "description": "Embark on an exciting virtual adventure together with a date to a virtual experience. Explore immersive virtual reality worlds, compete in thrilling multiplayer games, and create unforgettable memories from the comfort of your own home. It's a unique and futuristic date that will transport you to new realms of fun and excitement. ",
      "image": "./images/VirtualExperience.jpg",
      "id": 7,
      "indoor": true,
      "outdoor": false,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Dancing Class",
      "description": "Ignite the passion and rhythm in your relationship with a dancing class date. Learn new dance moves, sway to captivating music, and bond as you twirl and spin together on the dance floor. It's a lively and enchanting experience that will leave you feeling connected and in tune with each other.",
      "image": "./images/DanceClass.jpg",
      "id": 8,
      "indoor": true,
      "outdoor": true,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Rock Climbing",
      "description": "Embark on an adventurous and exhilarating date at rock climbing. Challenge yourselves on towering walls, conquer obstacles together, and celebrate each other's achievements as you reach new heights. It's a thrilling and empowering experience that will strengthen your bond while having a whole lot of fun. ",
      "image": "./images/ClimbingGym.jpg",
      "id": 9,
      "indoor": true,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Wine Tasting",
      "description": "Indulge in an enchanting wine-tasting experience as you savor a delightful selection of fine wines. Explore the rich aromas, flavors, and textures together, while learning about the art of winemaking. Let the elegant ambiance and shared appreciation for wine create a romantic and unforgettable date.",
      "image": "./images/WineTasting.jpg",
      "id": 10,
      "indoor": true,
      "outdoor": false,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Aquarium",
      "description": "Embark on an enchanting underwater journey as you explore the wonders of the ocean together at the aquarium. Marvel at colorful marine life, encounter majestic creatures and deepen your connection as you share the awe-inspiring beauty of the underwater world. Dive into a captivating date that will leave you with lasting memories. ",
      "image": "./images/Aquarium.jpg",
      "id": 11,
      "indoor": true,
      "outdoor": false,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Gig",
      "description": "Immerse yourselves in the electrifying atmosphere of live music as you enjoy a thrilling date at an indoor concert. Let the rhythm move you, the melodies captivate you, and the energy of the crowd amplify your connection. Share unforgettable moments and create a symphony of memories together in this unforgettable musical experience. ",
      "image": "./images/IndoorConcert.jpg",
      "id": 12,
      "indoor": true,
      "outdoor": true,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Karaoke Bar",
      "description": "Unleash your inner rockstar and ignite the stage with a karaoke date. Belt out your favorite tunes, serenade each other with duets and embrace the joy of singing your hearts out. Let the music bring you closer as you create harmonious memories and celebrate the magic of karaoke together.",
      "image": "./images/Karaoke.jpg",
      "id": 13,
      "indoor": true,
      "outdoor": false,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Theater",
      "description": "Experience the magic of the stage with a captivating theater date. Immerse yourselves in gripping performances, indulge in the world of storytelling, and share the thrill of live acting. Let the enchantment of the theater sweep you away and create unforgettable memories together. ",
      "image": "./images/Theater.jpg",
      "id": 14,
      "indoor": true,
      "outdoor": false,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Swimming",
      "description": "Dive into relaxation and enjoy a refreshing swimming pool date. Take a dip, unwind in the soothing waters, and bask in each other's company. Whether it's swimming laps or simply lounging poolside, this aquatic escape is the perfect setting for a splash of romance.  ",
      "image": "./images/IndoorSwimming.jpg",
      "id": 15,
      "indoor": true,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Spa",
      "description": "Indulge in pure bliss with a spa date for ultimate relaxation. Let the skilled therapists pamper you with soothing massages, rejuvenating facials, and a tranquil ambiance, creating a serene escape where you can unwind and reconnect with your partner in pure tranquility. ",
      "image": "./images/SpaExperience.jpg",
      "id": 16,
      "indoor": true,
      "outdoor": false,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Treasure Hunt Experience",
      "description": "Embark on an exhilarating treasure hunt with your date. Follow clues, uncover hidden surprises, and enjoy the thrill of unraveling mysteries together, creating unforgettable memories, and forging a deeper connection as you navigate through an adventure filled with excitement and anticipation.",
      "image": "./images/TreasureHunt.jpg",
      "id": 17,
      "indoor": false,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Yoga Class",
      "description": "Embark on a journey of relaxation and inner peace with your date as you join a rejuvenating yoga class. Find harmony and balance together, exploring different poses and connecting mind, body, and spirit, leaving the session feeling refreshed and centered, deepening your bond through shared serenity.",
      "image": "./images/YogaClass.jpg",
      "id": 18,
      "indoor": true,
      "outdoor": false,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Painting Class",
      "description": "Unleash your creativity and embark on a vibrant artistic adventure with your date during a 3-6 hour painting session. Express yourselves through brushstrokes and colors, as you create unique masterpieces together, fostering a playful and inspiring atmosphere, where imagination knows no bounds.",
      "image": "./images/Painting.jpg",
      "id": 19,
      "indoor": true,
      "outdoor": false,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Scuba Diving",
      "description": "Scuba diving is an underwater activity that allows individuals to explore the wonders of the underwater world. It involves using specialized equipment to breathe underwater and navigate beneath the surface.",
      "image": "./images/ScubaDiving.jpg",
      "id": 20,
      "indoor": true,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Mini Golf",
      "description": "A mini golf date is a fun and playful outing where you and your special someone enjoy a miniature golf course filled with colorful obstacles. It's a chance to bond, laugh, and create lasting memories in a lighthearted setting.",
      "image": "./images/MiniGolf.jpg",
      "id": 21,
      "indoor": true,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Photography Class",
      "description": "Capture precious moments together on a photography date. Join a course to learn the art of capturing stunning images, and exploring composition, lighting, and editing techniques. Spend 3-6 hours honing your skills, unleashing your creativity, and creating timeless memories through the lens. ",
      "image": "./images/Photography.jpg",
      "id": 22,
      "indoor": true,
      "outdoor": true,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Boat Trip",
      "description": "Embark on a virtual journey to a winery and its picturesque surroundings on a unique date. Explore the vineyards, learn about winemaking processes, and indulge in virtual wine tasting, all from the comfort of your home. Spend 3-6 hours immersed in the world of wine, discovering flavors, and  enjoying a virtual escape together. ",
      "image": "./images/BoatTrip.jpg",
      "id": 23,
      "indoor": false,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Baking Class",
      "description": "Ignite your passion for baking with a delightful date to a baking class. Join hands in the kitchen as you knead, mix, and create mouthwatering treats. From decadent desserts to savory delights, spend quality time together while exploring the art of baking in this hands-on experience.",
      "image": "./images/BakingSession.jpg",
      "id": 24,
      "indoor": true,
      "outdoor": false,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Cocktail Mixology Class",
      "description": "Shake up your date with a cocktail mixology class. Learn the art of crafting delicious and stylish cocktails from professional mixologists. Sip, shake, and stir your way through a variety of spirits, flavors, and techniques, creating memorable concoctions together in a fun and interactive setting.",
      "image": "./images/CocktailSession.jpg",
      "id": 25,
      "indoor": true,
      "outdoor": false,
      "night": true,
      "day": false,
      "long": true,
      "short": true
    },
    {
      "title": "Local Park Walk",
      "description": "Take a romantic stroll through a local park, hand in hand, as you immerse yourselves in the beauty of nature. Enjoy the serenity of lush greenery, fragrant flowers, and tranquil surroundings, creating cherished moments of togetherness and peaceful connection.",
      "image": "./images/LocalPark.jpg",
      "id": 26,
      "indoor": false,
      "outdoor": true,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Bike Ride",
      "description": "Embark on a delightful bike ride adventure together, exploring scenic routes, and picturesque landscapes, and feeling the exhilaration of the open road. Pedal side by side, creating memories while enjoying the fresh air, the freedom of movement, and the joy of shared experiences on two wheels.",
      "image": "./images/Cycling.jpg",
      "id": 27,
      "indoor": false,
      "outdoor": true,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Axe Throwing",
      "description": "Axe throwing is equally romantic and exciting, the perfect way to connect with your significant other. Axe throwing dates make for some really creative activities that allow you to get to know each other on a unique level! Engaging in something new will keep the date interesting and hard to forget.",
      "image": "./images/AxeThrowing.jpg",
      "id": 28,
      "indoor": true,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Visit A Farm",
      "description": "Embark on a charming farm adventure with your partner, exploring the idyllic countryside and getting up close with adorable farm animals. Experience the joys of rural life as you feed, pet, and learn about the farm's inhabitants, while savoring the fresh air and picturesque landscapes. Let this wholesome date cultivate shared memories and a deeper appreciation for nature's wonders. ",
      "image": "./images/VisitAFarm.jpg",
      "id": 29,
      "indoor": false,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Skateboarding",
      "description": "Embrace a fun and adventurous date on skateboards as you glide through the city streets or skate parks, sharing laughter and adrenaline-filled moments. Whether you're a beginner or a seasoned skaters, enjoy the thrill of learning new tricks, cheering each other on, and creating unforgettable memories on wheels. Let the skateboarding date spark a sense of freedom, camaraderie, and a shared passion for an active lifestyle.",
      "image": "./images/SkateBoarding.jpg",
      "id": 30,
      "indoor": true,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Zoo",
      "description": "Embark on a wild and enchanting date at the zoo, where you'll explore diverse ecosystems, encounter fascinating animals up close, and share awe-inspiring moments of discovery. From playful primates to majestic big cats, let the zoo date ignite your curiosity, deepen your connection, and create lasting memories amidst the wonders of the animal kingdom.",
      "image": "./images/Zoo.jpg",
      "id": 31,
      "indoor": false,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Kayaking",
      "description": "Embark on an adventurous date of kayaking, where you'll paddle together through serene waters, immerse in the beauty of nature, and embrace a sense of freedom and tranquility. Feel the thrill of gliding across the water, create shared moments of laughter and exploration, and strengthen your bond as you navigate the currents of an unforgettable kayaking experience.",
      "image": "./images/Kayaking.jpg",
      "id": 32,
      "indoor": false,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Tennis",
      "description": "Hit the court and ignite your competitive spirit on a tennis date. Engage in friendly rallies, challenge each other's skills, and experience the exhilaration of a dynamic game. Whether you're seasoned players or beginners, the shared love for the sport will fuel a fun-filled date filled with active moments, laughter, and a chance to showcase your agility and teamwork.",
      "image": "./images/Tennis.jpg",
      "id": 33,
      "indoor": false,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Paintball",
      "description": "Unleash your inner warrior on a date as you engage in intense tactical warfare, dodging paint-filled projectiles, and testing your teamwork and strategy in heart-pounding battles where victory is painted on the faces of champions.",
      "image": "./images/Paintball.jpg",
      "id": 34,
      "indoor": false,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Go-Karting",
      "description": "Feel the rush of speed on a date as you take on the track in lightning-fast go-karts, maneuvering through hairpin turns and exhilarating straightaways, experiencing the thrill of racing against the clock and fellow competitors in an adrenaline-fueled adventure.",
      "image": "./images/Gokart.jpg",
      "id": 35,
      "indoor": true,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Trail Hiking",
      "description": "Embark on a romantic journey amidst nature's beauty, as you traverse scenic trails hand in hand, immersing yourselves in breathtaking views, tranquil surroundings, and shared moments of exploration, creating memories that will last a lifetime.",
      "image": "./images/Hiking.jpg",
      "id": 36,
      "indoor": false,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Safari Tour",
      "description": "Safari Tour Date: Embark on an unforgettable adventure on [Date], as you and your partner venture into the wild, encountering majestic wildlife up close, witnessing awe-inspiring sights, and creating cherished memories amidst the untamed beauty of the savannah, where love and nature intertwine. ",
      "image": "./images/Safari.jpg",
      "id": 37,
      "indoor": false,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Hot Air Balloon Ride",
      "description": " Soar to new heights of romance as you and your loved one float above the world, embraced by the gentle breeze, taking in panoramic views of the landscape below, and sharing a magical, intimate experience that will leave you both breathless and enamored.",
      "image": "./images/HotAirBalloon.jpg",
      "id": 38,
      "indoor": false,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Amusement Park",
      "description": "Brace yourselves for an adrenaline-filled rendezvous as you indulge in thrilling rides, delightful games, and shared laughter, immersing yourselves in a world of pure joy and excitement, where the magic of childhood blends with the spark of romance. ",
      "image": "./images/AmusementPark.jpg",
      "id": 39,
      "indoor": false,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Helicopter Tour",
      "description": "Helicopter Tour Date: Elevate your love to new heights as you and your partner soar through the skies, gazing upon breathtaking landscapes and iconic landmarks, enveloped in the exhilarating whirl of rotor blades, creating a memory etched in the clouds, forever etching this moment in your hearts.",
      "image": "./images/HelicopterRide.jpg",
      "id": 40,
      "indoor": false,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Horse Riding",
      "description": "Experience the enchantment of a Date as you and your companion embark on a horseback adventure, riding through picturesque trails, forging a connection with these majestic creatures, and basking in the tranquility of nature, where romance and the rhythmic hoofbeats intertwine.",
      "image": "./images/HorseRiding.jpg",
      "id": 41,
      "indoor": false,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Archery",
      "description": "Unleash your inner Robin Hood or Katniss Everdeen on a date as you and your partner take aim at targets, honing your focus, skill, and precision in a timeless sport. Engage in friendly competition and shared moments of excitement, where Cupid's arrow meets the thrill of the bullseye.",
      "image": "./images/Archery.jpg",
      "id": 42,
      "indoor": false,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Skiing",
      "description": "Glide into romance as you carve your way through powdery slopes, embracing the winter wonderland together. Feel the rush of the cold wind on your faces and the warmth of each other's company, creating unforgettable memories amidst the snowy peaks.",
      "image": "./images/Skiing.jpg",
      "id": 43,
      "indoor": true,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Bungee Jumping",
      "description": "Take a leap of faith as you and your partner dive into an adrenaline-fueled adventure, free-falling into the abyss and experiencing an exhilarating rush together. Share a bond forged in bravery, as you conquer fears and create an unforgettable memory that will make your hearts soar.",
      "image": "./images/BungeeJumping.jpg",
      "id": 44,
      "indoor": false,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Badminton",
      "description": "Engage in a spirited game of agility and finesse as you and your partner rally back and forth, exchanging quick shots and friendly banter, creating a playful atmosphere of friendly competition and shared laughter, where every swing of the racket brings you closer together.",
      "image": "./images/Badminton.jpg",
      "id": 45,
      "indoor": true,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Airsoft",
      "description": "Airsoft is a recreational activity that simulates military combat using replica firearms that shoot non-lethal plastic pellets. It is often played in designated outdoor or indoor arenas specifically designed for the sport. Participants, commonly referred to as airsoft players or airsofters, engage in various game scenarios that require teamwork, strategy, and quick thinking.",
      "image": "./images/Airsoft.jpg",
      "id": 46,
      "indoor": false,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Laser Tag",
      "description": "Laser Tag is a popular indoor recreational activity that involves simulated laser tag games. Participants wear special vests with infrared sensors and carry laser guns. Players aim to tag opponents by shooting their laser guns at the sensors on their opponents' vests. The objective is to accumulate points by tagging opponents while avoiding being tagged yourself. It's a fast-paced and thrilling game that combines strategy, teamwork, and skill in a laser-lit arena.",
      "image": "./images/LaserQuest.jpg",
      "id": 47,
      "indoor": true,
      "outdoor": false,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Theme Park",
      "description": "A theme park is an amusement park that offers a wide range of entertainment attractions and rides, often centered around specific themes or concepts. It typically features thrilling roller coasters, water rides, live shows, interactive experiences, and various themed areas with games, food, and merchandise. Theme parks are designed to provide fun and excitement for visitors of all ages, making them popular destinations for families, friends, and thrill-seekers. They offer a day filled with entertainment, adventure, and memorable experiences.",
      "image": "./images/ThemePark.jpg",
      "id": 48,
      "indoor": false,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Arcade",
      "description": "An arcade is an entertainment venue that houses a variety of electronic and video games. It is a place where individuals can go to play arcade-style games, typically operated by inserting coins or tokens. Arcades feature a range of games, including classic arcade cabinets, pinball machines, racing simulators, shooting games, and other interactive experiences.",
      "image": "./images/Arcade.jpg",
      "id": 49,
      "indoor": true,
      "outdoor": false,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Ice Hockey Match",
      "description": "Ice hockey is a fast-paced team sport played on ice, typically in an indoor arena. It involves two teams of skaters, each equipped with ice skates, hockey sticks, and protective gear. The objective is to score goals by shooting a rubber puck into the opponent's net while defending one's own net.",
      "image": "./images/IceHockey.jpg",
      "id": 50,
      "indoor": true,
      "outdoor": false,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Ice Skating",
      "description": "Ice skating is a recreational activity and a competitive sport performed on ice. It involves gliding across the ice using ice skates attached to the feet. Ice skaters can perform various maneuvers, spins, jumps, and artistic movements, showcasing their skill and creativity.",
      "image": "./images/IceSkating.jpg",
      "id": 51,
      "indoor": true,
      "outdoor": false,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Comedy Night",
      "description": "A comedy night is an event or performance that showcases stand-up comedy and humor. It typically takes place in a comedy club, theater, or other entertainment venues.",
      "image": "./images/ComedyNight.jpg",
      "id": 52,
      "indoor": true,
      "outdoor": false,
      "night": true,
      "day": false,
      "long": true,
      "short": true
    },
    {
      "title": "Stargazing",
      "description": "Stargazing is a recreational activity that involves observing celestial objects, such as stars, planets, and constellations, in the night sky. It can be done from various locations, including backyards, parks, or designated stargazing areas.",
      "image": "./images/Stargazing.jpg",
      "id": 53,
      "indoor": false,
      "outdoor": true,
      "night": true,
      "day": false,
      "long": true,
      "short": true
    },
    {
      "title": "Camping",
      "description": "Camping is a recreational activity that involves spending time outdoors, typically overnight, in a temporary shelter such as a tent or camper. It offers an opportunity to connect with nature, escape the bustle of daily life, and enjoy various outdoor activities.",
      "image": "./images/Camping.jpg",
      "id": 54,
      "indoor": false,
      "outdoor": true,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Ghost Tour",
      "description": "A ghost tour is a guided tour that explores haunted locations and shares stories and legends associated with them. It combines elements of history, folklore, and the supernatural to provide an eerie and thrilling experience for participants.",
      "image": "./images/GhostTour.jpg",
      "id": 55,
      "indoor": false,
      "outdoor": true,
      "night": true,
      "day": false,
      "long": true,
      "short": true
    },
    {
      "title": "Night Hike",
      "description": "A nighttime hike is an outdoor activity that involves hiking on trails or through natural areas after dark. It offers a unique experience of exploring nature under the cover of darkness and enjoying the peaceful ambiance of the nighttime environment.",
      "image": "./images/NightTimeHike.jpg",
      "id": 56,
      "indoor": false,
      "outdoor": true,
      "night": true,
      "day": false,
      "long": true,
      "short": true
    },
    {
      "title": "Scream Park",
      "description": "A scream park is an entertainment venue or attraction that offers a combination of haunted houses, scare zones, and other frightening experiences. It aims to provide a thrilling and immersive environment where visitors can experience fear and adrenaline-inducing encounters.",
      "image": "./images/ScreamPark.jpeg",
      "id": 57,
      "indoor": false,
      "outdoor": true,
      "night": true,
      "day": false,
      "long": true,
      "short": true
    },
    {
      "title": "Museum",
      "description": "From the way museums are lit on evening tours to the salacious history behind different objects, museums are a great place to turn up the heat between you and your date. If you’re looking to keep the vibe more romantic and less school field trip, plan your first museum date at night. Many museums are open in the evening at least once per week and often have a totally different vibe at night than during the day.",
      "image": "./images/Museum.jpg",
      "id": 58,
      "indoor": true,
      "outdoor": false,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },

    {
      "title": "Beach",
      "description": "Plan a day to relax in the sun, swim, and have a picnic by the shore. we recommend doing something active like beach volleyball or Frisbee. You can also go out on a sunset beach date by grabbing beach chairs and watching the sunset. There are lots of beach date ideas you can do at the beach with your partner.",
      "image": "./images/Beach.jpg",
      "id": 59,
      "indoor": false,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },

    {
      "title": "Music Festival",
      "description": "It's a great way to experience the local culture, try different foods, and enjoy live music or performances. It’s a festival. You’re surrounded by hundreds or thousands of people with a smile on their faces. That’s not something you’ll get the benefit of in your local, so feel free to enjoy the good vibes.",
      "image": "./images/Festival.jpg",
      "id": 60,
      "indoor": false,
      "outdoor": true,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },

    {
      "title": "Escape Room",
      "description": "If you want to leave a lasting impression, you can't beat the Escape Room date. Navigating an Escape Room is a thrill that will give you plenty to talk about. Your date is going to remember this first date! It's such a unique, stand-out experience that you will make great memories together from the word go.",
      "image": "./images/EscapeRoom.jpg",
      "id": 61,
      "indoor": true,
      "outdoor": false,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },

    {
      "title": "Cinema",
      "description": "Dinner and movie is a classic for good reason — you get the best of both worlds: food and a good flick. A movie date can lead to a great time. For sure, it’s an evergreen teen date idea, but it’s something even older and seasoned daters have started using in recent times. That’s because this kind of date is easy, comfortable, and it has plenty of scope for sitting a little closer.",
      "image": "./images/Cinema.jpg",
      "id": 62,
      "indoor": true,
      "outdoor": false,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },

    {
      "title": "Outdoor Cinema",
      "description": "Dinner and movie is a classic for good reason — you get the best of both worlds: food and a good flick. A movie date can lead to a great time. For sure, it’s an evergreen teen date idea, but it’s something even older and seasoned daters have started using in recent times. That’s because this kind of date is easy, comfortable, and it has plenty of scope for sitting a little closer.",
      "image": "./images/CinemaOutdoor.jpg",
      "id": 63,
      "indoor": false,
      "outdoor": true,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Salsa Dancing",
      "description": "Spice up your evening with a salsa dancing lesson, learning sultry moves and enjoying the rhythm of Latin music.",
      "image": "./images/SalsaDancing.jpg",
      "id": 64,
      "indoor": true,
      "outdoor": false,
      "night": true,
      "day": false,
      "long": true,
      "short": true
    },
    {
      "title": "Farmers Market Stroll",
      "description": "Take a leisurely stroll through a local farmers market, exploring fresh produce, artisanal goods, and enjoying the vibrant atmosphere.",
      "image": "./images/FarmersMarket.jpg",
      "id": 65,
      "indoor": false,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Roller Disco",
      "description": "Roller disco as a date is a fantastic choice for a fun and energetic outing. Picture this: you and your partner stepping into a retro-themed roller rink, surrounded by colorful lights and upbeat music. As you lace up your roller skates, the excitement builds.",
      "image": "./images/RollerDisco.jpg",
      "id": 66,
      "indoor": true,
      "outdoor": false,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Shooting Range",
      "description": "Going to a shooting range as a date can be a thrilling and unique experience. You and your partner embark on an adventure to test your shooting skills in a safe and controlled environment. The shooting range offers a variety of firearms to choose from, allowing you to try different types and calibers.",
      "image": "./images/ShootingRange.jpg",
      "id": 67,
      "indoor": true,
      "outdoor": true,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Surfing",
      "description": "Surfing as a date is an adventurous and exhilarating experience. You and your partner hit the beach with surfboards in hand, ready to ride the waves. You cheer each other on, laugh at wipeouts, and celebrate successful rides. The salty ocean air and warm sun create a relaxed atmosphere, perfect for bonding and enjoying each other's company.",
      "image": "./images/Surfing.jpg",
      "id": 68,
      "indoor": true,
      "outdoor": true,
      "night": true,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Comic Con",
      "description": "Comic Con as a date is an incredibly fun and immersive experience. Dressed in cosplay or simply as enthusiastic fans, you and your partner dive into a world of fantasy and pop culture.",
      "image": "./images/ComicCon.jpg",
      "id": 69,
      "indoor": true,
      "outdoor": false,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Water Park",
      "description": "A water park date is an exhilarating and refreshing choice for a fun-filled day. Imagine you and your partner arriving at the water park, excitedly donning your swimsuits and sunscreen. The air is filled with the sound of laughter and splashing water, setting the tone for a memorable adventure.",
      "image": "./images/WaterPark.jpg",
      "id": 70,
      "indoor": false,
      "outdoor": true,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Crystal Maze Experience",
      "description": "The Crystal Maze Experience is based on the popular British TV show, The Crystal Maze. It's a real-life team challenge that involves various tasks in four themed zones: Aztec, Industrial, Futuristic and Medieval. It is an immersive experience and teams have to solve puzzles and take on challenges to earn crystals.",
      "image": "./images/CrystalMaze.jpg",
      "id": 71,
      "indoor": true,
      "outdoor": false,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Upside Down House",
      "description": "Step inside the house, and let yourselves be immersed in the topsy-turvy world. Everything will be inverted, from the furniture to the decor on the walls. Encourage your partner to take playful pictures and have fun with the upside-down concept.",
      "image": "./images/UpsideDownHouse.jpg",
      "id": 72,
      "indoor": true,
      "outdoor": false,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    },
    {
      "title": "Indoor Skydiving",
      "description": "Experience the thrill of flight in a controlled environment. Dress comfortably, receive training, and then take flight together in the wind tunnel. Cheer each other on and capture the exciting moments. It's a unique and adventurous date that you'll both remember.",
      "image": "./images/IndoorSkydiving.jpg",
      "id": 73,
      "indoor": true,
      "outdoor": false,
      "night": false,
      "day": true,
      "long": true,
      "short": true
    }
  ]
}
