const userPreferencesToOptionsMap = {

  //Indoor or Outdoor
  //Day or night
  //Short or Long
    "1,1,1": [1, 2, 3, 4, 5, 6, 7, 8, 9],
    "1,2,2": [11, 12, 20, ],
    "1,2,1": [2, 4, 6, 8],
    "2,1,1": [, , , ],
    "2,1,2": [, , , ],
    "2,2,2": [, , , ],
  };
[
  {
    "title": "Cooking Class",
    "description": "Experience a culinary adventure with your partner in a cooking class date. Learn the art of preparing delicious dishes under the guidance of skilled chefs. Explore new flavors, techniques, and create culinary masterpieces together. Indulge in a fun and interactive date where you bond over food, laughter, and shared culinary creativity.",
    "image": ".assets/images/cooking",
    "id": 1
  },
  {
    "title": "Art gallery ",
    "description": "Immerse yourselves in the world of creativity on a captivating art gallery date. Discover captivating masterpieces, engage in thought-provoking conversations, and appreciate the beauty of local art. Let the vibrant artwork inspire and deepen your connection as you explore the rich artistic expressions together. ",
    "image": ".assets/images/ArtGallery",
    "id": 2
  },
  {
    "title": "Pottery workshops ",
    "description": "Unleash your creativity and get your hands dirty on a pottery workshop date. Mold clay into beautiful creations together, while enjoying a hands-on experience that sparks laughter and connection. Explore the art of ceramics as you shape memories and create lasting masterpieces side by side.",
    "image": ".assets/images/PotteryClass",
    "id": 3
  },
  {
    "title": "Board game",
    "description": "Bring out the competitive spirit on a board game date or double date. Gather around the table, strategize, and have a blast with classic or modern board games. Enjoy friendly banter, laughter, and a fun-filled evening of bonding over dice rolls and card flips. ",
    "image": "",
    "id": 4
  },
  {
    "title": "Botanical garden",
    "description": "Escape into a lush oasis with a date to an indoor botanical garden. Stroll hand in hand amidst vibrant flora, immerse yourselves in the serene atmosphere, and discover the beauty of nature together. A perfect setting for intimate conversations and creating lasting memories.",
    "image": ".assets/images/BotanicalGarden",
    "id": 5
  },
  {
    "title": "An indoor picnic",
    "description": "Indulge in a cozy indoor picnic date, where you can savor delicious treats and create a romantic atmosphere away from the elements. With soft blankets, ambient lighting, and delightful bites, it's a perfect setting for an intimate and memorable experience together.",
    "image": ".assets/images/Picnic",
    "id": 6
  },
  {
    "title": "Virtual experience arcade",
    "description": "Embark on an exciting virtual adventure together with a date to a virtual experience arcade. Explore immersive virtual reality worlds, compete in thrilling multiplayer games, and create unforgettable memories from the comfort of your own home. It's a unique and futuristic date that will transport you to new realms of fun and excitement. ",
    "image": ".assets/images/VirtualExperience",
    "id": 7
  },
  {
    "title": "Dancing Class",
    "description": "Ignite the passion and rhythm in your relationship with a dancing class date. Learn new dance moves, sway to captivating music, and bond as you twirl and spin together on the dance floor. It's a lively and enchanting experience that will leave you feeling connected and in tune with each other.",
    "image": ".assets/images/DanceClass",
    "id": 8
  },
  {
    "title": "Climbing gym",
    "description": "Embark on an adventurous and exhilarating date at a climbing gym. Challenge yourselves on towering walls, conquer obstacles together, and celebrate each other's achievements as you reach new heights. It's a thrilling and empowering experience that will strengthen your bond while having a whole lot of fun. ",
    "image": ".assets/images/ClimbingGym",
    "id": 9
  },
  {
    "title": "Wine tasting",
    "description": " Indulge in an enchanting wine tasting experience as you savor a delightful selection of fine wines. Explore the rich aromas, flavors, and textures together, while learning about the art of winemaking. Let the elegant ambiance and shared appreciation for wine create a romantic and unforgettable date.",
    "image": ".assets/images/WineTasting",
    "id": 10
  },
  {
    "title": "Visit an aquarium",
    "description": "Embark on an enchanting underwater journey as you explore the wonders of the ocean together at the aquarium. Marvel at colorful marine life, encounter majestic creatures, and deepen your connection as you share the awe-inspiring beauty of the underwater world. Dive into a captivating date that will leave you with lasting memories. ",
    "image": ".assets/images/Aquarium",
    "id": 11
  },
  {
    "title": "Indoor concert",
    "description": "Immerse yourselves in the electrifying atmosphere of live music as you enjoy a thrilling date at an indoor concert. Let the rhythm move you, the melodies captivate you, and the energy of the crowd amplify your connection. Share unforgettable moments and create a symphony of memories together in this unforgettable musical experience. ",
    "image": ".assets/images/IndoorConcert",
    "id": 12
  },
  {
    "title": "Karaoke",
    "description": "Unleash your inner rockstar and ignite the stage with a karaoke date. Belt out your favorite tunes, serenade each other with duets, and embrace the joy of singing your hearts out. Let the music bring you closer as you create harmonious memories and celebrate the magic of karaoke together.",
    "image": ".assets/images/Karaoke",
    "id": 13
  },
  {
    "title": "Theater",
    "description": "Experience the magic of the stage with a captivating theater date. Immerse yourselves in gripping performances, indulge in the world of storytelling, and share the thrill of live acting. Let the enchantment of the theater sweep you away and create unforgettable memories together. ",
    "image": ".assets/images/Theater",
    "id": 14
  },
  {
    "title": "Indoor swimming",
    "description": "Dive into relaxation and enjoy a refreshing indoor swimming pool date. Take a dip, unwind in the soothing waters, and bask in each other's company. Whether it's swimming laps or simply lounging poolside, this aquatic escape is the perfect setting for a splash of romance.  ",
    "image": "",
    "id": 15
  },
  {
    "title": "Spa",
    "description": "Indulge in pure bliss with a spa date for ultimate relaxation. Let the skilled therapists pamper you with soothing massages, rejuvenating facials, and tranquil ambiance, creating a serene escape where you can unwind and reconnect with your partner in pure tranquility. ",
    "image": "",
    "id": 16
  },
  {
    "title": "An indoor treasure hunt",
    "description": "Embark on an exhilarating indoor treasure hunt with your date. Follow clues, uncover hidden surprises, and enjoy the thrill of unraveling mysteries together, creating unforgettable memories and forging a deeper connection as you navigate through an adventure filled with excitement and anticipation.",
    "image": "",
    "id": 17
  },
  {
    "title": "Yoga class",
    "description": "Embark on a journey of relaxation and inner peace with your date as you join a rejuvenating yoga class. Find harmony and balance together, exploring different poses and connecting mind, body, and spirit, leaving the session feeling refreshed and centered, deepening your bond through shared serenity.",
    "image": "",
    "id": 18
  },
  {
    "title": "Painting",
    "description": " Unleash your creativity and embark on a vibrant artistic adventure with your date during a 3-6 hour painting session. Express yourselves through brushstrokes and colors, as you create unique masterpieces together, fostering a playful and inspiring atmosphere, where imagination knows no bounds.",
    "image": "",
    "id": 19
  },
  {
    "title": "Sculpture",
    "description": " Sculpt your way to a memorable date as you explore the art of three-dimensional creation together. Spend some hours  molding clay or sculpting materials into beautiful shapes, allowing your hands to shape your shared experience. Unleash your inner artist and enjoy a unique and tactile journey of self-expression.",
    "image": "",
    "id": 20
  },
  {
    "title": "Learn to play an instrument toghether",
    "description": "Embark on a melodic adventure with your date as you learn to play an instrument together. Spend 3-6 hours harmonizing your efforts, strumming the chords or tickling the ivories, creating beautiful music and unforgettable memories. Let the rhythm guide your connection and discover the joy of making music side by side. ",
    "image": "",
    "id": 21
  },
  {
    "title": "Photography course",
    "description": "Capture precious moments together on a photography date. Join a course to learn the art of capturing stunning images, exploring composition, lighting, and editing techniques. Spend 3-6 hours honing your skills, unleashing your creativity, and creating timeless memories through the lens. ",
    "image": "",
    "id": 22
  },
  {
    "title": "Take a virtual tour of a winery",
    "description": "Embark on a virtual journey to a winery and its picturesque surroundings on a unique date. Explore the vineyards, learn about winemaking processes, and indulge in virtual wine tasting, all from the comfort of your home. Spend 3-6 hours immersed in the world of wine, discovering flavors, and enjoying a virtual escape together. ",
    "image": "",
    "id": 23
  },
  {
    "title": "Baking sessions",
    "description": "Ignite your passion for baking with a delightful date to a baking session. Join hands in the kitchen as you knead, mix, and create mouthwatering treats. From decadent desserts to savory delights, spend quality time together while exploring the art of baking in this hands-on experience.",
    "image": "",
    "id": 24
  },
  {
    "title": "Cocktail mixology session",
    "description": "Shake up your date  with a cocktail mixology session. Learn the art of crafting delicious and stylish cocktails from professional mixologists. Sip, shake, and stir your way through a variety of spirits, flavors, and techniques, creating memorable concoctions together in a fun and interactive setting.",
    "image": "",
    "id": 25
  },
  {
    "title": "Walk in a local park",
    "description": "Take a romantic stroll through a local park, hand in hand, as you immerse yourselves in the beauty of nature. Enjoy the serenity of lush greenery, fragrant flowers, and tranquil surroundings, creating cherished moments of togetherness and peaceful connection.",
    "image": "",
    "id": 26
  },
  {
    "title": "Bike ride ",
    "description": "Embark on a delightful bike ride adventure together, exploring scenic routes, picturesque landscapes, and feeling the exhilaration of the open road. Pedal side by side, creating memories while enjoying the fresh air, the freedom of movement, and the joy of shared experiences on two wheels.",
    "image": "",
    "id": 27
  },
  {
    "title": "Gardening",
    "description": "Unleash your green thumbs and connect with nature on a romantic gardening date. Plant seeds of love as you dig into the soil, nurture plants, and witness the beauty of growth together. Share laughter, bond over blooms, and cultivate a lasting connection while creating a flourishing garden paradise.",
    "image": "",
    "id": 28
  },
  {
    "title": "Visit a farm",
    "description": "Embark on a charming farm adventure with your partner, exploring the idyllic countryside and getting up close with adorable farm animals. Experience the joys of rural life as you feed, pet, and learn about the farm's inhabitants, while savoring the fresh air and picturesque landscapes. Let this wholesome date cultivate shared memories and a deeper appreciation for nature's wonders. ",
    "image": "",
    "id": 29
  },
  {
    "title": "Skateboarding",
    "description": "Embrace a fun and adventurous date on skateboards as you glide through the city streets or skate parks, sharing laughter and adrenaline-filled moments. Whether you're beginners or seasoned skaters, enjoy the thrill of learning new tricks, cheering each other on, and creating unforgettable memories on wheels. Let the skateboarding date spark a sense of freedom, camaraderie, and a shared passion for an active lifestyle.",
    "image": "",
    "id": 30
  },
  {
    "title": "Zoo",
    "description": "Embark on a wild and enchanting date at the zoo, where you'll explore diverse ecosystems, encounter fascinating animals up close, and share awe-inspiring moments of discovery. From playful primates to majestic big cats, let the zoo date ignite your curiosity, deepen your connection, and create lasting memories amidst the wonders of the animal kingdom.",
    "image": "",
    "id": 31
  },
  {
    "title": "Kayaking",
    "description": "Embark on an adventurous date of kayaking, where you'll paddle together through serene waters, immerse in the beauty of nature, and embrace a sense of freedom and tranquility. Feel the thrill of gliding across the water, create shared moments of laughter and exploration, and strengthen your bond as you navigate the currents of an unforgettable kayaking experience.",
    "image": "",
    "id": 32
  },
  {
    "title": "Tennis",
    "description": "Hit the court and ignite your competitive spirit on a tennis date. Engage in friendly rallies, challenge each other's skills, and experience the exhilaration of a dynamic game. Whether you're seasoned players or beginners, the shared love for the sport will fuel a fun-filled date filled with active moments, laughter, and a chance to showcase your agility and teamwork.",
    "image": "",
    "id": 33
  },
  {
    "title": "Paintball",
    "description": "Unleash your inner warrior on a  date as you engage in intense tactical warfare, dodging paint-filled projectiles, and testing your teamwork and strategy in heart-pounding battles where victory is painted on the faces of champions.",
    "image": "",
    "id": 34
  },
  {
    "title": "Karting",
    "description": "Feel the rush of speed on a  date as you take on the track in lightning-fast go-karts, maneuvering through hairpin turns and exhilarating straightaways, experiencing the thrill of racing against the clock and fellow competitors in an adrenaline-fueled adventure.",
    "image": "",
    "id": 35
  },
  {
    "title": "Hiking trails",
    "description": "Embark on a romantic journey amidst nature's beauty , as you traverse scenic trails hand in hand, immersing yourselves in breathtaking views, tranquil surroundings, and shared moments of exploration, creating memories that will last a lifetime.",
    "image": "",
    "id": 36
  },
  {
    "title": "Safari Tour",
    "description": "Safari Tour Date: Embark on an unforgettable adventure on [Date], as you and your partner venture into the wild, encountering majestic wildlife up close, witnessing awe-inspiring sights, and creating cherished memories amidst the untamed beauty of the savannah, where love and nature intertwine. ",
    "image": "",
    "id": 37
  },
  {
    "title": "Hot Air Baloon Ride",
    "description": " Soar to new heights of romance as you and your loved one float above the world, embraced by the gentle breeze, taking in panoramic views of the landscape below, and sharing a magical, intimate experience that will leave you both breathless and enamored.",
    "image": "",
    "id": 38
  },
  {
    "title": "Amusement park",
    "description": "Brace yourselves for an adrenaline-filled rendezvous as you indulge in thrilling rides, delightful games, and shared laughter, immersing yourselves in a world of pure joy and excitement, where the magic of childhood blends with the spark of romance. ",
    "image": "",
    "id": 39
  },
  {
    "title": "Helicopter Tour",
    "description": "Helicopter Tour Date: Elevate your love to new heights as you and your partner soar through the skies, gazing upon breathtaking landscapes and iconic landmarks, enveloped in the exhilarating whirl of rotor blades, creating a memory etched in the clouds, forever etching this moment in your hearts.",
    "image": "",
    "id": 40
  },
  {
    "title": "Horse Riding",
    "description": " Experience the enchantment of a Date as you and your companion embark on a horseback adventure, riding through picturesque trails, forging a connection with these majestic creatures, and basking in the tranquility of nature, where romance and the rhythmic hoofbeats intertwine.",
    "image": "",
    "id": 41
  },
  {
    "title": "Archery",
    "description": "Unleash your inner Robin Hood or Katniss Everdeen on a date as you and your partner take aim at targets, honing your focus, skill, and precision in a timeless sport. Engage in friendly competition and shared moments of excitement, where Cupid's arrow meets the thrill of the bullseye.",
    "image": "",
    "id": 42
  },
  {
    "title": "Skiing",
    "description": "Glide into romance  as you carve your way through powdery slopes, embracing the winter wonderland together. Feel the rush of the cold wind on your faces and the warmth of each other's company, creating unforgettable memories amidst the snowy peaks.",
    "image": "",
    "id": 43
  },
  {
    "title": "Bungee Jumping",
    "description": "Take a leap of faith as you and your partner dive into an adrenaline-fueled adventure, free-falling into the abyss and experiencing an exhilarating rush together. Share a bond forged in bravery, as you conquer fears and create an unforgettable memory that will make your hearts soar.",
    "image": "",
    "id": 44
  },
  {
    "title": "Badmington",
    "description": "Engage in a spirited game of agility and finesse as you and your partner rally back and forth, exchanging quick shots and friendly banter, creating a playful atmosphere of friendly competition and shared laughter, where every swing of the racket brings you closer together.",
    "image": "",
    "id": 45
  }
]